СостоянииЭксплуатируемогоОборудования/src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ОборудованиеОрганизации</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПереченьОборудования</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СостоянииЭксплуатируемогоОборудования/src/AccumulationRegisters/ОборудованиеОрганизации/ОборудованиеОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОборудованиеОрганизации</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СостояниеОборудования</name>
    <type>
      <types>EnumRef.СостояниеОборудования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГоденДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭксплуатироватьДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

СостоянииЭксплуатируемогоОборудования/src/Enums/СостояниеОборудования/СостояниеОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеОборудования</name>
  <enumValues>
    <name>НаСкладе</name>
  </enumValues>
  <enumValues>
    <name>ВЭксплуатации</name>
  </enumValues>
</mdclass:Enum>

СостоянииЭксплуатируемогоОборудования/src/Documents/ПриходнаяНакладная/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОборудованиеОрганизации
	Движения.ОборудованиеОрганизации.Записывать = Истина;
	Движения.ОборудованиеОрганизации.Записать();

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриходнаяНакладнаяПереченьОборудования.Оборудование,
		|	ПриходнаяНакладнаяПереченьОборудования.СрокГодности,
		|	СУММА(ПриходнаяНакладнаяПереченьОборудования.Количество) КАК Количество,
		|	СУММА(ПриходнаяНакладнаяПереченьОборудования.Цена) КАК Цена,
		|	СУММА(ПриходнаяНакладнаяПереченьОборудования.Сумма) КАК Сумма
		|ИЗ
		|	Документ.ПриходнаяНакладная.ПереченьОборудования КАК ПриходнаяНакладнаяПереченьОборудования
		|ГДЕ
		|	ПриходнаяНакладнаяПереченьОборудования.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ПриходнаяНакладнаяПереченьОборудования.Оборудование,
		|	ПриходнаяНакладнаяПереченьОборудования.СрокГодности";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	СостояниеНаСкладе = Перечисления.СостояниеОборудования.НаСкладе;
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ОборудованиеОрганизации.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Оборудование = Выборка.Оборудование;
		Движение.СостояниеОборудования = СостояниеНаСкладе;
		Движение.ГоденДо = ДобавитьМесяц(Дата, Выборка.СрокГодности);
		Движение.Количество = Выборка.Количество;
		Движение.Сумма = Выборка.Сумма;
	КонецЦикла;	
	
КонецПроцедуры
#КонецОбласти
#КонецЕсли
